name1 = "function1"


class Mk1(object):

    def __init__(self):
        print(Mk1.__str__(self))
        print("测试模块1")


class MkTest(object):

    def __init__(self):
        print("function1----")


def test1():
    print("test1")


# ———————————————————————————————————————模块单独测试块写法——————————————————————————————————————————————————————————
def test():  # 测试函数
    print("我是测试代码")  # 每一个.py文件都是一个模块，当被导入的时候，python会将所有没有缩进的文件都执行一遍，但只要有判断是否在当前文件执行，就可以避免这个问题


print(f"当前文件是{__name__}")  # __name__只有在当前文件才会输出__main__，如果被导入到其他文件就会输出当前模块名称——————用于测试代码
if __name__ == "__main__":  # 判断是否单独运行此模块，如果是，就执行，否则不执行————判断是否在当前文件单独执行，如果不是不执行
    test()
# ———————————————————————————————————————————————————————————————————————————————————————————————————————————————
