# 只使用map函数来执行1-9的数字平方，并且转成字符串
a = map(str, map(lambda x: x ** 2, range(1, 10)))
for i in a:
    print(i)
print()

# 使用reduce来使列表中的数字变为整数；例如[1, 2, 3, 4, 5]===>123456
from functools import reduce


# def test1(x, y):
#     return str(x) + str(y)
def test1(x, y):
    return x * 10 + y  # 传入第一个值乘以10加上下一个数然后作为初始值再次进行循环


b = reduce(test1, [1, 3, 5, 7, 9])
# print(int(b))
print(b)
print()

# 去除带4的手机号
data = [18303517744, 115020030417, 15088931331, 115906878938, 13646514938, 13706636314, 18867793298, 13739742666,
        15731102345, 13859652222, 118232102678, 113601261337, 15231099666, 18337728521, 15203802168, 18331758666,
        18736599499, 113930109099, 11573888289, 115738888538, 115738888576, 1573888697, 15738888963, 113797904444,
        15243191111, 18405311888, 18405312888, 13791080000, 13791090000, 13908376207, 13908335110]
str_data = []
for i in data:
    str_data.append(str(i))

c = filter(lambda x: "4" not in x, str_data)
print(list(c))
